runs/w4_laminarPipeFlowIntermediate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          217;
        startFace       13286;
    }
    wall
    {
        type            patch;
        physicalType    patch;
        nFaces          336;
        startFace       13503;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          217;
        startFace       13839;
    }
)

// ************************************************************************* //
